# Challenge

- 코드스테이츠 DS 부트캠프 어드미션을 위한 Challenge 과제 입니다. 
- 아래 challenge 를 풀기 위해 제공된 강의가 모든 것을 알려주진 않습니다. 
- 따라서 필요한 부분은 스스로 google 검색을 통해 이 challenge 를 완성해 주셔야 합니다. 
- 각 shell 에 필요한 부분을 작성하신 후 함께 링크를 제출해 주시면 됩니다.
- 모든 결과물은 하나의 shell에서 모두 실행될 수 있도록 print문을 사용해 주세요. run all 했을 때 전체 shell 이 모두 잘 실행될 수 있도록 관리해 주세요.

In [1]:
# 1. 다음의 list 에서 두 번째 list elemnet 를 print 해 보세요
list_01 = ['Paul', 'John', 'Ringo', 'George']
print(list_01[1])  # 순서는 0부터 시작

John

In [2]:
# 2. 다음의 list in the list에서 두 번째 element 를 print 해 보세요
list_02 = [['Paul', 'John', 'Ringo', 'George']]
print(list_02[0][1])

John

In [8]:
# Initializing list  
list_01 = [ 1, 6, 3, 5, 3, 4 ] 
list_02 = [ 1, 6, 3, 5, 3 ] 

# for loop을 이용하여 두 개의 리스트 안에 4가 있는지 없는지 print 하는 코드를 작성하세요

for i in range(0,6):      # range(0,6)은 0번째부터 5번째를 의미 (즉, 1부터 6까지)
    if list_01[i] == 4:   # 참고 : list(range(0,6))를 이용해서 나열될 숫자를 볼 수 있음
      value = 1
    else:
      value = 0

if value == 1:
  print("있습니다.")
else:
  print("없습니다.")
  

for d in range(0,5):
  if list_02[d] == 4:
    value = 1
  else:
    value = 0

if value == 1:
  print("있습니다.")
else:
  print("없습니다.")

있습니다.
없습니다.

In [10]:
# 위 코드 역할을 하는 함수를 작성해 보세요.

def test(list):                         # list라는 변수로 함수 test 설정
  for i in range(0, len(list)):         # list의 개수에 따라 몇 번째까지 반복해야 하는지 변하므로 len 활용
    if list[i] == 4:
      value = 1
    else:
      value = 0
  
  if value == 1:
    print("있습니다.")
  else:
    print("없습니다.")

test(list_01)
test(list_02)

있습니다.
없습니다.

In [11]:
list_03 = [4, 5, 8, 9, 10] 
# 위 list element 중 8보다 큰 숫자가 몇 개가 있는지 코드로 작성해 보세요. 

count = 0                   # 0부터 숫자를 세야 하므로 숫자 0 설정
for i in range(0, 5):
  if list_03[i] > 8:
    count = count + 1       # 조건을 만족할 때마다 count에 1을 더함

print(count)

2

In [16]:
# BMI
height = [1.87,  1.87, 1.82, 1.91, 1.90, 1.85]
weight = [81.65, 97.52, 95.25, 92.98, 86.18, 88.45]

# bmi = weight / height ** 2 를 numpy array 활용하여 구해보세요

import numpy as np          # numpy 불러오기
h = np.array(height)        # 계산 용이하게 numpy array 변환
w = np.array(weight)

bmi = w / h ** 2
print(bmi)


# bmi 가 24 이상인 값들만 선택해 보세요

choose = bmi > 24     # bmi가 24보다 큰 값의 위치 저장
print(bmi[choose])    # 해당되는 위치의 값만 산출

[23.34925219 27.88755755 28.75558507 25.48723993 23.87257618 25.84368152]
[27.88755755 28.75558507 25.48723993 25.84368152]

In [18]:
# pandas 패키지 라이브러리를 불러오세요

import pandas as pd         # pandas 불러오기

# 아래 내용을 담는 pandas Dataframe 을 생성하세요
# {'Bob': ['I liked it.', 'It was awful.'], 'Sue': ['Pretty good.', 'Bland.']}

data = {
    'Bob' : ['I liked it.', 'It was awful.'],     # 표 만들기
    'Sue' : ['Pretty good.', 'Bland.']
}

df = pd.DataFrame(data)       # pandas를 이용하여 dataframe으로 변환
df

             Bob           Sue
0    I liked it.  Pretty good.
1  It was awful.        Bland.

In [25]:
# 아래와 같은 dataframe을 만들어 보세요. (참고: 연도가 index가 되게 해 주세요)
"""
year dept     revenue
2015 Sales    30
2016 Sales    35
2017 Sales    40
"""

data = {                                        # 표 만들기
    'dept' : ['Sales', 'Sales', 'Sales'],
    'revenue' : [30, 35, 40]
}

year = [2015, 2016, 2017]                       # index로 설정할 데이터
df = pd.DataFrame(data, index = year)           # dataframe으로 변환, index 설정
df.index.name = "year"                          # index 이름 설정
df

# 2017년 데이터만 선택해 보세요

df_2 = df.iloc[2:]            # iloc는 index의 위치, loc는 index의 이름으로 선택
df_2

# 조건(condition)을 활용하여 revenue 30 이상으로만 filter 해 보세요. reference: https://pandas.pydata.org/pandas-docs/stable/getting_started/intro_tutorials/03_subset_data.html 

cond = df["revenue"] >= 30          # revenue >= 30인 조건 변수 설정
df_3 = df[cond]                     # 조건에 맞게 filter
df_3

       dept  revenue
year
2015  Sales       30
2016  Sales       35
2017  Sales       40

In [26]:
# 'https://web.stanford.edu/class/archive/cs/cs109/cs109.1166/stuff/titanic.csv' 자료를 불러와 dataframe으로 만들어 보세요 

df_csv = pd.read_csv("https://web.stanford.edu/class/archive/cs/cs109/cs109.1166/stuff/titanic.csv")    # csv 불러와 dataframe으로 저장
df_csv.head()

   Survived  Pclass  ... Parents/Children Aboard     Fare
0         0       3  ...                       0   7.2500
1         1       1  ...                       0  71.2833
2         1       3  ...                       0   7.9250
3         1       1  ...                       0  53.1000
4         0       3  ...                       0   8.0500

[5 rows x 8 columns]

In [32]:
# 타이타닉 데이터의 shape은 어떻게 되나요? 

df_csv.shape          # shape 확인 : 행과 열 갯수

# 타이타닉 row record에서 10~20번째 줄을 출력해 보세요

df_csv[9:20]          # 10~20번째 줄 추출

# 타이타닉 데이터에서 'Survived', 'Age', 'Sex' 칼럼 데이터를 선택해 보세요

df_csv[["Survived", "Age", "Sex"]]      # loc, iloc를 이용해 행과 열을 모두 지정해도 됨

# 타이타닉 데이터에서 생존자 데이터만 골라보세요

cond_ti = df_csv["Survived"] == 1     # 생존자 조건 설정
df_csv[cond_ti]

# 생존자 데이터 중 여자, 남자 중 누가 더 많나요? 참고: https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.value_counts.html

df_surv = df_csv[cond_ti]           # 생존자 데이터 변수 설정
df_surv["Sex"].value_counts()       # 생존자 데이터 중 남, 여 숫자 비교 : 여자가 더 많음

female    233
male      109
Name: Sex, dtype: int64